robotics_lab_5.tex
% Created 2025-07-15 Tue 11:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Joel Boynton}
\date{\today}
\title{Robotics Lab 5\\\medskip
\large Motor Balancing}
\hypersetup{
 pdfauthor={Joel Boynton},
 pdftitle={Robotics Lab 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.3 (Org mode 9.7.29)}, 
 pdflang={English}}
\begin{document}

\maketitle
\clearpage
\section{Analyzing the Code}
\label{sec:orge24ced6}

\subsection{What lines of code or variable represents the reference signal / input?}
\label{sec:orgb8e4a24}
\begin{verbatim}
float targetSpeed = 15;
\end{verbatim}
\begin{itemize}
\item Above  represents our reference signal. It is the speed we want our right motor to achieve
\end{itemize}
\subsection{What lines of code represent the controller?}
\label{sec:org656549a}
\begin{verbatim}
float rightError = leftCount - rightCount;

int rightSpeed = targetSpeed + rightError * kp;
\end{verbatim}
\begin{itemize}
\item These lines listed above represent the controllers for the right motor. They control how the right speed is corrected in speed based on error between the left and right motors
\end{itemize}
\subsection{What represents the feedback? How does this work into the error term?}
\label{sec:orgad3218b}
\begin{verbatim}
float rightCount = getEncoderRightCnt();
\end{verbatim}
\begin{itemize}
\item The line stated above represents our feedback. These are actual measurements of the wheel movement. This feedback of wheel movements allows us to actually compute the error. This can then be used in our corrections.
\end{itemize}
\subsection{Which variable represents the system gain? How does the controller use the system gain?}
\label{sec:orga59417a}
\begin{verbatim}
float kp = 0.1;
\end{verbatim}
\begin{itemize}
\item The variable listed above represents the system gain. This determines how strongly the controller reacts to an error. The controller uses this by adding the product of the error and gain to the target speed. Thus creating the correction.
\end{itemize}
\section{Experiment 1}
\label{sec:orga8f3bfd}
\texttt{Set the gain variable to 0, build, upload, and run the code. Consider how the robot is driving.}
\subsection{What effect does setting the gain to 0 have on the system? Does this completely negate the effects of the control system?}
\label{sec:org5cf24e2}
\begin{itemize}
\item Setting the gain to 0 makes it so the robot will not adjust if one motor moves faster/slower than the other. So, yes. It effectively disables the corrective mechanism that the control uses.
\end{itemize}
\section{Experiment 2}
\label{sec:orgbe12be2}
\texttt{Set the gain variable back to 0.1, build, upload, and run the code again. Contrast the results of this value with the results of experiment 1.}
\subsection{Does this drive more straight, or nearly the same? What effect did this value have on the code?}
\label{sec:org1ac1772}
\begin{itemize}
\item It definitely drives more straight. By giving the gain a value above zero we provide the robot with a corrective mechanism that can make minute adjustments.
\end{itemize}
\section{Experiment 3}
\label{sec:org18948f1}
\texttt{Set the gain variable to 0.25, build, upload, and run the code again. If you felt like last time appeared about the same, you should now observe a noticeable difference. However, you might occasionally notice the robot jerk quickly from time to time when compensating.}
\subsection{Does this perform better or worse than the results  in Experiment 2?}
\label{sec:org11954e5}
\begin{itemize}
\item To me I believe it performs a little worse than the results in Experiment 2, as you can see it overcompensate a little bit.
\end{itemize}
\section{Experiment 4}
\label{sec:orgeb58fec}
\texttt{Set the gain variable to 0.5, build, upload, and run the code again. Note the behavior of the robot. It is likely jerking around wildly as each wheel attempts to catch up to the other in short bursts. This is what we would call an unstable control system, brought about by the gain value. The error is being amplified too much and the motors are now overcompensating for their errors.}

\texttt{This is an issue that can be solved with more complex controllers. In many cases, a proportional control won't be able to satisfy the requirements for a control system. In this application, we can likely adjust the value of the gain empirically through trial and error to find the "sweet spot" value, where the system reacts enough to make the robot drive straight, but not so much that the system becomes unstable.}
\subsection{What value would you guess would be a sweet spot from your observations in these experiments? Try that value on the robot in one last run and record the results.}
\label{sec:org630ae17}
\begin{itemize}
\item I thikn \textbf{0.15} would be a good sweet spot. Upon trying the value it seemed to drive pretty straight. There were vert few instances of compensation that were particularly noticeabe.
\end{itemize}
\end{document}
